package home.alicesmagic.mw.view;

import javax.swing.*;

class ToolTips {
    String forTfLetters =
            "<html><center>Это поле предназначено для ввода букв, из<br>" +
            "которых будут построены слова русского языка.<br>" +
            "Не забывайте про гласные буквы.<br>" +
            "Можно просто ввести любое длинное слово.<br>" +
            "Например: 'велосипедистка'";
    String forBRun =
            "<html><center>Эта кнопка запустит процесс поиска слов,<br>" +
            "полностью состоящих из введенных вами букв.<br>" +
            "Чем больше букв введено, тем больше слов<br>" +
            "будет найдено.";
    String forPanSpin =
            "<html><center>Установите требуемую минимальную длину<br>" +
            "искомых слов. Слова состоящие из меньшего<br>" +
            "количества букв не попадут в результат поиска.<br>" +
            "Устанавливать длину можно как перед поиском,<br>" +
            "так и после него.";
    String forTfWord =
            "<html><center>При вводе символов в это поле, будет осуществляться<br>" +
            "поиск подходящего слова в словаре. Если ваше слово<br>" +
            "в словаре отсутствует, вы сможете его добавить,<br>" +
            "нажав кнопку 'Добавить слово'";
    String forBAdd =
            "<html><center>Эта кнопка поможет вам добавить слово в словарь,<br>" +
            "только если это слово в словаре отсутствует.<br>" +
            "Пожалуйста, добавляйте слово, будучи абсолютно<br>" +
            "уверенным в правильности его написания.";
    String forBShow =
            "<html><center>Словарь загружен в скрытом режиме.<br>" +
            "Чтобы его увидеть, нужно нажать на эту кнопку.<br>" +
            "Загрузка займет определенное время.<br>" +
            "Придется немного подождать.";
}
